Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem.SetEntity Method
 Stores the entity in the UI data item.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEntity(
	Entity entity
)
Public Sub SetEntity (
	entity As Entity
)
public:
void SetEntity(
	Entity^ entity
)
member SetEntity :
        entity : Entity -> unit
Parameters
entity Entity
 The Entity to be stored.
Exceptions
Exception | Condition
ArgumentException |  Writing of Entities of this Schema is not allowed to the current add-in.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace